/* ===== Generic ===== */

/* Generic Cancel button title, used in SKConversation NSErrorFromPREMIUM_VIDEO_STATUS */
"BUTTONTITLE_CANCEL" = "Peruuta";

/* ===== SkyLib Properties ===== */

/* List item title for user's home phone number. */
"CONTACT_PHONE_HOME" = "Koti";

/* List item title for user's office phone number */
"CONTACT_PHONE_OFFICE" = "Työ";

/* List item title for user's mobile phone number. */
"CONTACT_PHONE_MOBILE" = "Matkapuhelin";

/* List item title for user's (possible) other phone number(s). */
"CONTACT_PHONE_OTHER" = "Muu";

/* Format to use to wrap guest contact displays */
"CONTACT_GUEST_FORMAT" = "%@ (vieras)";

/* All known contacts group title */
"CONTACT_GROUP_ALL_KNOWN_CONTACTS" = "Kaikki tunnetut yhteyshenkilöt";

/* All buddies group title */
"CONTACT_GROUP_ALL_BUDDIES" = "Kaikki yhteyshenkilöt";

/* Skype group title */
"CONTACT_GROUP_SKYPE_BUDDIES" = "Skype-yhteyshenkilöt";

/* SkypeOut group title */
"CONTACT_GROUP_SKYPEOUT_BUDDIES" = "Tallennetut puhelinnumerot";

/* Online buddies group title */
"CONTACT_GROUP_ONLINE_BUDDIES" = "Online-yhteyshenkilöt";

/* Unknown or pending auth group title */
"CONTACT_GROUP_UNKNOWN_OR_PENDINGAUTH_BUDDIES" = "Lähetetyt pyynnöt";

/* Recently contacted group title */
"CONTACT_GROUP_RECENTLY_CONTACTED_CONTACTS" = "Viimeisimmät yhteydet";

/* Contacts waiting my auth group title */
"CONTACT_GROUP_CONTACTS_WAITING_MY_AUTHORIZATION" = "Vastaanotetut pyynnöt";

/* Authorized by me group title */
"CONTACT_GROUP_CONTACTS_AUTHORIZED_BY_ME" = "Hyväksytyt pyynnöt";

/* Blocked group title */
"CONTACT_GROUP_CONTACTS_BLOCKED_BY_ME" = "Estetyt yhteyshenkilöt";

/* Ungrouped contacts group title */
"CONTACT_GROUP_UNGROUPED_BUDDIES" = "Ryhmittämättömät yhteyshenkilöt";

/* Windows Live ID contacts group title */
"CONTACT_GROUP_PASSPORT_CONTACTS" = "Messenger";

/* Suggested contacts group title */
"CONTACT_GROUP_SCD_CONTACTS" = "Ehdotetut yhteyshenkilöt";

/* New group default title */
"CONTACT_GROUP_NEW_GROUP" = "Nimetön luettelo";

/* Default message sent to contacts from whom we are requesting authorization */
"CONTACT_AUTH_REQUEST_DEFAULT_MESSAGE" = "Lisää minut yhteyshenkilöksi";

/*  */
"ECHO123_CONTACT_FULLNAME" = "Skype-testipuhelu";

/*  */
"ECHO123_CONTACT_LANGUAGES" = "fi";

/*  */
"ECHO123_CONTACT_HOMEPAGE" = "www.skype.com/go/help";

/* Automatic sound test service mood message. */
"ECHO123_CONTACT_ABOUT" = "Hei, olen Skypen testipuhelurobotti. Lisää minut yhteystietoihisi ja soita minulle, niin voit tarkistaa ääniasetuksesi. Lisäohjeita on osoitteessa http://www.skype.com/go/help. Kiitos.";

/*  */
"ECHO123_CONTACT_MOOD_TEXT" = "Testaa laitteesi äänet soittamalla minulle";


/* UNPLACED call status used when a call is initialized, but not connected to the network yet. */
"CALL_STATUS_UNPLACED" = "Puhelu yhdistetään";

/* ROUTING call status used when a call is being routed by the network but not ringing yet. */
"CALL_STATUS_ROUTING" = "Puhelu yhdistetään";

/* CANCELLED call status indicating that the outgoing call was cancelled by the user. */
"CALL_STATUS_CANCELLED" = "Puhelu peruutettu";

/* FAILED call status used when the call failed. */
"CALL_STATUS_FAILED" = "Puhelu epäonnistui";

/* RINGING_OUT call status used when a call is ringing for the remote party. */
"CALL_STATUS_RINGING_OUT" = "Hälyttää";

/* RINGING_IN call status used when a call is ringing locally. */
"CALL_STATUS_RINGING_IN" = "Soittaa";

/* LOCALHOLD call status indicating that the user put the call on hold. */
"CALL_STATUS_LOCALHOLD" = "Puhelu pidossa";

/* REMOTEHOLD call status indicating that the call is on hold by the remote party. */
"CALL_STATUS_REMOTEHOLD" = "Olet pidossa";

/* FINISHED call status indicating that the call was finished. */
"CALL_STATUS_FINISHED" = "Valmis";

/* MISSED call status indicating that the incoming call was finished before it got answered. */
"CALL_STATUS_MISSED" = "Vastaamattomat";

/* REFUSED call status indicating that the remote party declined the call. */
"CALL_STATUS_REFUSED" = "Hylätyt";

/* BUSY call status indicating that the remote party was already in a call. */
"CALL_STATUS_BUSY" = "Varattu";

/* DROPPED call status indicating that the network connection was lost during the call. */
"CALL_STATUS_DROPPED" = "Yhteys katkesi";

/* VOICEMAIL call status indicating that the call was diverted to voicemail. */
"CALL_STATUS_VOICEMAIL" = "Ääniviesti";

/* VM_RECORDING call status while recording the voicemail. */
"CALL_STATUS_VM_RECORDING" = "Nauhoitetaan ääniviestiä";

/* VM_UPLOADING call status while sending the voicemail. */
"CALL_STATUS_VM_UPLOADING" = "Lähetään ääniviestiä";

/* VM_SENT call status after the voicemail was sent. */
"CALL_STATUS_VM_SENT" = "Ääniviesti lähetetty";

/* VM_CANCELLED call status when the recording or sending of the voicemail was cancelled. */
"CALL_STATUS_VM_CANCELLED" = "Ääniviesti peruutettu";

/* VM_FAILED call status when the recording or sending of the voicemail failed. */
"CALL_STATUS_VM_FAILED" = "Ääniviesti epäonnistui";

/* ===== Wallet Transacation ===== */
/* Title of instrument name in popup button (args: instrument name ["Visa"], number ["****1234"]) */
"WALLET_INSTRUMENT_DISPLAY_NAME_FORMAT" = "%1$@ %2$@";


/* ===== PARTICIPANT_VOICE_STATUS ===== */ 

/* VOICE_CONNECTING status used when a call is being routed by the network but not ringing yet. */
"PARTICIPANT_VOICE_STATUS_CONNECTING" = "Yhdistetään";

/* RINGING status when a participant is ringing. */
"PARTICIPANT_VOICE_STATUS_RINGING" = "Hälyttää";

/* EARLY_MEDIA status when a participant is ringing. */
"PARTICIPANT_VOICE_STATUS_EARLY_MEDIA" = "Hälyttää";

/* ON_HOLD status when a participant is held. */
"PARTICIPANT_VOICE_STATUS_ON_HOLD" = "Pidossa";

/* STOPPED status when a participant has stopped. */
"PARTICIPANT_VOICE_STATUS_STOPPED" = "Lopetti";

/* FACEBOOK calling */
"PARTICIPANT_VOICE_STATUS_CONNECTING_FACEBOOK" = "Soitetaan Facebookissa (beeta)";

/* ===== CONVERSATION_LOCAL_LIVESTATUS ===== */ 
"CONVERSATION_LOCAL_LIVESTATUS_STARTING" = "Soitetaan…";
"CONVERSATION_LOCAL_LIVESTATUS_RINGING_FOR_ME" = "Soitetaan…";
"CONVERSATION_LOCAL_LIVESTATUS_IM_LIVE" = "Puhelu käynnissä";
"CONVERSATION_LOCAL_LIVESTATUS_ON_HOLD_LOCALLY" = "Pidossa";
"CONVERSATION_LOCAL_LIVESTATUS_ON_HOLD_REMOTELY" = "Olet pidossa";
"CONVERSATION_LOCAL_LIVESTATUS_OTHERS_ARE_LIVE" = "Puhelu käynnissä";
"CONVERSATION_LOCAL_LIVESTATUS_OTHERS_ARE_LIVE_FULL" = "Puhelu on täynnä";
"CONVERSATION_LOCAL_LIVESTATUS_PLAYING_VOICE_MESSAGE" = "Äänitervehdystä toistetaan";
"CONVERSATION_LOCAL_LIVESTATUS_RECORDING_VOICE_MESSAGE" = "Nauhoitetaan ääniviestiä";
"CONVERSATION_LOCAL_LIVESTATUS_RECENTLY_LIVE" = "Äskeinen puhelu";
"CONVERSATION_LOCAL_LIVESTATUS_TRANSFERRING" = "Siirretään tätä puhelua";


/*  */
"CONVERSATION_POST_FILES_BODY" = "Julkaistut tiedostot";

/* CONVERSATION Legacy chat message for older clients */
"CONVERSATION_VIDEOMESSAGE_LEGACY_MESSAGE" = "Sait videoviestin. Voit avata sen osoitteesta %1 koodilla %2";

"CONVERSATION_XMM_LEGACY_MESSAGE" = "%1$@ – katso se täällä: %%1.";

"CONVERSATION_MEDIAMESSAGE_LEGACY_MESSAGE" = "Katso jaettu kuva siirtymällä osoitteeseen: %1";
"CONVERSATION_XMM_MESSAGE_LEGACY_MESSAGE" = "Katso jaettu mediatiedosto siirtymällä osoitteeseen %1";

/*  */
"CONTACT_AVAILABILITY_OFFLINE" = "Offline-tilassa";
"CONTACT_AVAILABILITY_ONLINE" = "Online-tilassa";
"CONTACT_AVAILABILITY_AWAY" = "Poissa";
"CONTACT_AVAILABILITY_DO_NOT_DISTURB" = "Älä häiritse";
"CONTACT_AVAILABILITY_PENDING_AUTH" = "Yhteyspyyntöä käsitellään";
"CONTACT_AVAILABILITY_BLOCKED" = "Estetty";
"CONTACT_AVAILABILITY_OFFLINE_BUT_VM_ABLE" = "Offline-tila ääniviesteillä";
"CONTACT_AVAILABILITY_OFFLINE_BUT_CF_ABLE" = "Siirretään puhelut";

/*  */
"CONTACT_AVAILABILITY_INVISIBLE" = "Näkymätön";
"CONTACT_AVAILABILITY_CONNECTING" = "Yhdistetään";
"CONTACT_AVAILABILITY_SKYPEOUT" = "Puhelinnumero";

/*  */
"CONTACT_GENDER_FEMALE" = "Nainen";

/*  */
"CONTACT_GENDER_MALE" = "Mies";

/* A hidden phone number. */
"CONTACT_UNKNOWN_PSTN_DISPLAYNAME" = "Tuntematon numero";

/* Title for conversation with no participants */
"CONVERSATION_UNTITLED_DISPLAYNAME" = "Ei otsikkoa";


"ACCOUNTMANAGER_LOGIN_STATUS" = "Kirjaudutaan…";
"ACCOUNTMANAGER_CBLSYNC_STATUS" = "Ladataan yhteystietoja…";
"ACCOUNTMANAGER_UPGRADEDB_STATUS" = "Päivitetään tiedostoja…";


/* Chat info message when a party has been joined to the chat. %1$@ is the name of the user who did the adding, while %2$@ is the name of the added user. */
"ChatMessage::ADDEDMEMBERS_FORMATSTRING" = "%1$@ lisäsi käyttäjän %2$@";

/* Chat info message shown when user %@ has left the chat. */
"ChatMessage::LEFT_FORMATSTRING" = "%@ on poistunut";

/* Chat info message when the first user ejected (threw out) the second user from the chat. */
"ChatMessage::KICKED_FORMATSTRING" = "%1$@ poisti käyttäjän %2$@";

/* Chat info message shown when a party has changed the chat topic. %1$@ is the user who did it, and %2$@ the new topic. */
"ChatMessage::SETTOPIC_FORMATSTRING" = "%1$@ muutti keskustelun aiheeksi %2$@";

/* Chat item shown in place of the message to tell that the message has been removed by its writer. */
"CHATMESSAGE_MESSAGEREMOVED_TEXT" = "Tämä viesti on poistettu";

/* AV Preferences output device name */
"SAME_AS_SYSTEM_DEVICE_NAME" = "Sama kuin järjestelmä";


/* ===== SkyLib Error/Result Codes ===== */

/* sync errors at login/registration */
"LOGOUTREASON_NETWORKERROR" = "Skypeen ei saada yhteyttä.";
"LOGOUTREASON_NETWORKERROR_RECOVERYSUGGESTION" = "Tarkista verkkoasetuksesi ja yritä uudelleen.";

/* sync errors at registration */
"Account::INVALID_SKYPENAME" = "Virheellinen Skype-nimi.";
"Account::INVALID_EMAIL" = "Virheellinen sähköpostiosoite.";
"Account::INVALID_EMAIL_RECOVERYSUGGESTION" = "Tarkista se ja yritä uudelleen.";
"Account::UNACCEPTABLE_PASSWORD" = "Virheellinen salasana.";
"Account::SKYPENAME_TAKEN" = "Tämä Skype-nimi on jo varattu.";
"Account::SKYPENAME_TAKEN_RECOVERYSUGGESTION" = "Anna uusi nimi.";

/* sync errors at login */
"Account::NO_SUCH_IDENTITY" = "Tuntematon Skype-nimi ja salasana.";
"Account::INCORRECT_PASSWORD" = "Tuntematon Skype-nimi ja salasana.";
"Account::TOO_MANY_LOGIN_ATTEMPTS" = "Liian monta epäonnistunutta kirjautumisyritystä.";
"Account::TOO_MANY_LOGIN_ATTEMPTS_RECOVERYSUGGESTION" = "Yritä myöhemmin uudelleen.";

/* async errors (can happen anytime while logged in) */
"Account::PASSWORD_HAS_CHANGED" = "Salasanasi on muuttunut.";
"Account::PASSWORD_HAS_CHANGED_RECOVERYSUGGESTION" = "Kirjaudu sisään uudella salasanallasi.";

"LOGOUTREASON_GENERIC_RECOVERYSUGGESTION" = "Ole hyvä ja yritä uudelleen.";

/* Account property validation error - NSLocalizedFailureReasonErrorKey [#HELLC-1021], [#WIN-364] */
"SkyLib::TOO_SHORT" = "Sen on oltava 6–20 merkkiä.";
"SkyLib::TOO_LONG" = "Sen on oltava 6–20 merkkiä.";
"SkyLib::CONTAINS_INVALID_CHAR" = "Virheellinen merkki, esim. Σ, à tai ß.";
"SkyLib::CONTAINS_SPACE" = "Välilyönti tai sarkain ei ole sallittu.";
"SkyLib::SAME_AS_USERNAME" = "Liian samankaltainen kuin Skype-nimesi.";
"SkyLib::INVALID_FORMAT" = "Virheellinen muoto.";
"SkyLib::CONTAINS_INVALID_WORD" = "Liian helppo arvata, esim. abcd tai skype.";
"SkyLib::TOO_SIMPLE" = "Vähintään yksi kirjain ja yksi numero.";
"SkyLib::STARTS_WITH_INVALID_CHAR" = "Täytyy alkaa kirjaimella (A–Z).";

/* Account property validation error - NSLocalizedRecoverySuggestionErrorKey */
"SkyLib::TOO_SHORT_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Kokeile pidempää Skype-nimeä.";
"SkyLib::TOO_SHORT_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Koeta pidempää salasanaa.";
"SkyLib::TOO_LONG_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Koeta lyhyempää Skype-nimeä.";
"SkyLib::TOO_LONG_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Koeta lyhyempää salasanaa.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Koeta jotain toista Skype-nimeä.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Koeta jotain toista salasanaa.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_CONTACT_EMAILS" = "Koeta jotain toista sähköpostiosoitetta.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION" = "Koeta jotain toista arvoa.";

/* Account password change error - NSLocalizedFailureReasonErrorKey */
"Account::PWD_INVALID_OLD_PASSWORD" = "Väärä salasana.";
"Account::PWD_SERVER_CONNECT_FAILED" = "Palvelimeen ei saatu yhteyttä.";
"Account::PWD_MUST_DIFFER_FROM_OLD" = "Uusi salasana ei voi olla sama kuin vanha.";
"Account::PWD_INVALID_NEW_PWD" = "Virheellinen salasana.";
"Account::PWD_MUST_LOG_IN_TO_CHANGE" =  "Kirjaudu sisään, jotta voit vaihtaa salasanasi.";

/* COMMITFAILED status received when committing a server-side property change. */
"ACCOUNT_COMMITSTATUS_COMMIT_FAILED" = "Muutosta ei voitu tallentaa. Tarkista asetus ja yritä uudelleen.";

"ACCOUNT_NOCREDIT" = "Ei saldoa";
"ACCOUNT_FREECALL" = "ilmainen puhelu";

/* Conversation file transfer errors */
"SkyLib::TRANSFER_BAD_FILENAME" = "Virheellinen tiedostonimi";
"SkyLib::TRANSFER_OPEN_FAILED" = "Tiedoston avaaminen ei onnistunut";
"SkyLib::TRANSFER_TOO_MANY_PARALLEL" = "Liian monta yhtäaikaista tiedostonsiirtoa";

/* ===== SKSkypeKitErrorDomain Errors ===== */

/* SKErrorOffline */
"SKERROR_OFFLINE_DESCRIPTION" = "Olet offline-tilassa.";

"SKERROR_OFFLINE_CALL_FAILUREREASON" = "Sinun on oltava online-tilassa, jotta voit soittaa puheluita.";
"SKERROR_OFFLINE_CONTACTSEARCH_FAILUREREASON" = "Et voi hakea yhteystietoja, kun olet offline-tilassa. Muuta tilaasi ja yritä uudelleen.";
"SKERROR_OFFLINE_SMS_FAILUREREASON" = "Sinun on oltava online-tilassa, jotta voit lähettää tekstiviestin.";

/* [#HELLC-894] */
"SKERROR_OFFLINE_VOICEMAIL_FAILUREREASON" = "Sinun on oltava online-tilassa, jotta voit toistaa tämän viestin.";

/* Alert sheet title */
"SKERROR_CANNOT_SET_BODY_SMS_DESCRIPTION" = "Nykyisen tekstiviestin tekstiä ei voi asettaa.";


/* SKErrorInsufficientFunds */
"Sms::INSUFFICIENT_FUNDS" = "Skype-saldo ei riitä tekstiviestin lähettämiseen.";
"CMEMBER_PSTN_STATUSTEXT_INSUFFICIENTCREDIT" = "Tarvitset Skype-saldoa soittaaksesi tähän numeroon.";

/* SKErrorInvalidContact */
"SKERROR_INVALIDCONTACT" = "Skype-nimi tai puhelinnumero ei ole kelvollinen.";

/* SKErrorCallOfflineLyncContact */
"SKERROR_OFFLINELYNCCONTACT_CALL_FAILUREREASON" = "Et voi soittaa tälle Lync-yhteyshenkilölle, koska hän on offline-tilassa.";

/* SKErrorBlockedContact */
"SKERROR_CONTACTBLOCKED_CALL_FAILUREREASON" = "Et voi soittaa tälle henkilölle, koska olet estänyt hänet.";
"SKERROR_CONTACTBLOCKED_CHAT_FAILUREREASON" = "Et voi keskustella tämän henkilön kanssa, koska olet estänyt hänet.";
"SKERROR_CONTACTBLOCKED_SMS_FAILUREREASON" = "Et voi lähettää tekstiviestiä tälle henkilölle, koska olet estänyt hänet.";
"SKERROR_CONTACTBLOCKED_ADD_FAILUREREASON" = "Et voi lisätä tätä henkilöä, koska olet estänyt hänet.";

/* SKErrorCantTalkToYourself */
"SKERROR_CANTTALKTOYOURSELF_CALL_FAILUREREASON" = "Et voi soittaa itsellesi.";
"SKERROR_CANTTALKTOYOURSELF_CHAT_FAILUREREASON" = "Et voi keskustella itsesi kanssa.";
"SKERROR_CANTTALKTOYOURSELF_ADD_FAILUREREASON"  = "Et voi lisätä itseäsi.";

/* SKErrorCantJoinConversation */
"SKERROR_CANTJOINCONVERSATION_FAILUREREASON" = "Et voi liittyä tähän keskusteluun";

/* SKErrorCantFindConversation */
"SKERROR_CANTFINDCONVERSATION_FAILUREREASON" = "Keskustelua ei löydy";

/* SKErrorInvalidPSTNNumber */
"CMEMBER_PSTN_STATUSTEXT_INVALIDNUMBER" = "Tämä ei ole kelvollinen puhelinnumero.";

/* SKErrorEmergencyPSTNNumber */
"SKERROR_EMERGENCYCALL_FAILUREREASON" = "Et voi soittaa tähän numeroon, koska se on hätänumero.";
"SKERROR_EMERGENCYSMS_FAILUREREASON" = "Et voi lähettää tekstiviestiä tähän numeroon, koska se on hätänumero.";
"SKERROR_EMERGENCYADD_FAILUREREASON" = "Et voi lisätä tätä numeroa, koska se on hätänumero.";

/* SKErrorCallExists */
"SKERROR_CALLEXISTS_CALL" = "Tämä puhelu on lopetettava ennen kuin voit aloittaa uuden.";
"SKERROR_CALLEXISTS_VOICEMAIL" = "Jos haluat kuunnella ääniviestin, lopeta tämä puhelu ensin.";
"SKERROR_CALLFAILED" = "Puhelu epäonnistui. Yritä uudelleen.";

/* SKErrorTooManyChatParticipants */
"SKERROR_TOOMANYPARTICIPANTS_CHAT_DESCRIPTION" = "Yritit aloittaa keskustelun liian monen yhteyshenkilön kanssa.";

/* SKErrorInvalidConversationIdentities */
"SKERROR_INVALIDCONVERSATIONIDENTITIES_DESCRIPTION" = "Et voi keskustella näiden yhteyshenkilöiden kanssa.";

/* CMEMBER_FAILUREREASON */
"CMEMBER_FAILUREREASON_CALLER_NOT_AUTHORIZED" = "Et voi soittaa tälle henkilölle, koska hän ei ole valtuuttanut sinua.";
"CMEMBER_FAILUREREASON_CALLER_NOT_FRIEND" = "Et voi soittaa tälle henkilölle, koska hän ei ole valtuuttanut sinua.";

/* SMS_FAILUREREASON */
"Sms::INVALID_CONFIRMATION_CODE" = "Virheellinen vahvistuskoodi";
"Sms::MISC_ERROR" = "Virheellinen puhelinnumero";

/* Conversation::PREMIUM_VIDEO_STATUS */

/*
"PV_RESULT_400_BAD_REQUEST_SOME_FIELDS_MISSING_MESSAGE" = "PV_RESULT_400_BAD_REQUEST_SOME_FIELDS_MISSING_MESSAGE";
"PV_RESULT_401_P2P_BLOCK_MESSAGE" = "PV_RESULT_401_P2P_BLOCK_MESSAGE";
*/

"PV_RESULT_403_PAID_SERVICE_BLOCK_MESSAGE" = "Tilisi käyttö on estetty.";
"PV_RESULT_403_PAID_SERVICE_BLOCK_EXPLANATION" = "Ota yhteyttä asiakastukeen.";

"PV_RESULT_405_GROUP_TOO_LARGE_MESSAGE" = "Puhelussa on liikaa osallistujia ryhmänäköpuhelua varten.";
"PV_RESULT_405_GROUP_TOO_LARGE_EXPLANATION" = "Ryhmänäköpuhelussa voi olla lisäksesi enintään 9 osallistujaa. Poista henkilöitä tästä ryhmästä ja yritä uudelleen.";

/*
"PV_RESULT_410_NO_VALID_SUBSCRIPTION_BUT_TRIAL_IS_AVAILABLE_MESSAGE" = "PV_RESULT_410_NO_VALID_SUBSCRIPTION_BUT_TRIAL_IS_AVAILABLE_MESSAGE";
*/

"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_MESSAGE" = "Puhelussa on liikaa osallistujia ryhmänäköpuhelua varten.";
"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_EXPLANATION_BETA" = "Näköpuhelussa voi olla lisäksesi enintään 9 osallistujaa. Poista henkilöitä tästä keskustelusta ja yritä uudelleen.";
"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_EXPLANATION" = "Ryhmänäköpuhelupakettisi ei kata näin montaa henkilöä. Poista henkilöitä tästä keskustelusta ja yritä uudelleen.";

"PV_RESULT_414_NO_SUBSCRIPTION_MESSAGE_BETA" = "Ryhmänäköpuheluiden soittaminen edellyttää pakettia.";
"PV_RESULT_414_NO_SUBSCRIPTION_MESSAGE" = "Ryhmänäköpuheluiden soittaminen edellyttää pakettia.";
"PV_RESULT_414_NO_SUBSCRIPTION_EXPLANATION_BETA" = "Haluatko soittaa ryhmänäköpuhelun?";
"PV_RESULT_414_NO_SUBSCRIPTION_EXPLANATION" = "Haluatko soittaa ryhmänäköpuhelun?";

"PV_RESULT_416_SUBSCRIPTION_IS_ALREADY_IN_USE_MESSAGE" = "Olet jo mukana ryhmänäköpuhelussa.";
"PV_RESULT_416_SUBSCRIPTION_IS_ALREADY_IN_USE_EXPLANATION" = "Useita ryhmänäköpuheluita ei voi olla samanaikaisesti käynnissä.";

"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_MESSAGE" = "Olet saavuttanut puhelukohtaisen ylärajan.";
"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_EXPLANATION_BETA" = "Olet saavuttanut ryhmänäköpuhelujen 4 tunnin puhelukohtaisen ylärajan.";
"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_EXPLANATION" = "Olet saavuttanut ryhmänäköpuhelujen 4 tunnin puhelukohtaisen ylärajan. Katso lisätietoja oman tilisi tiedoista.";

"PV_RESULT_422_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_DAY_LIMIT_REACHED_MESSAGE" = "Olet saavuttanut päivittäisen ryhmänäköpuheluiden ylärajan.";
"PV_RESULT_422_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_DAY_LIMIT_REACHED_EXPLANATION" = "Ryhmänäköpuhelut on poistettu käytöstä tilapäisesti. Olet saavuttanut päivittäisen kohtuullisen käytön ylärajan. Katso lisätietoja oman tilisi tiedoista.";

"PV_RESULT_424_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_MONTH_LIMIT_REACHED_MESSAGE" = "Olet saavuttanut tämän kuukauden ryhmänäköpuheluiden ylärajan.";
"PV_RESULT_424_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_MONTH_LIMIT_REACHED_EXPLANATION" = "Ryhmänäköpuhelut on poistettu käytöstä tilapäisesti. Olet saavuttanut tämän kuukauden kohtuullisen käytön ylärajan. Katso lisätietoja oman tilisi tiedoista.";

/*
"PV_RESULT_430_GRACE_TIME_EXPIRED_MESSAGE" = "RESULT_430_GRACE_TIME_EXPIRED";
*/

"PV_RESULT_500_GENERAL_SERVICE_ERROR_MESSAGE" = "Ryhmänäköpuhelu ei ole nyt käytettävissä.";
"PV_RESULT_500_GENERAL_SERVICE_ERROR_EXPLANATION" = "Tapahtui virhe. Yritä myöhemmin uudelleen.";

/*
"PV_RESULT_503_SERVICE_TIMEOUT_MESSAGE" = "RESULT_503_SERVICE_TIMEOUT";
*/

"PremiumVideoErrorRecovery_GetPremium_BETA" = "Hanki ryhmänäköpuhelutoiminto";
"PremiumVideoErrorRecovery_GetPremium" = "Hanki ryhmänäköpuhelutoiminto";
"PremiumVideoErrorRecovery_UpgradePremium" = "Päivitä";

/* ===== SKAccessSessionFailureReasonErrorDomain Errors ===== */

"AccessSession::NO_BALANCE" = "Skype WiFin käyttöön tarvitaan Skype-saldoa.";
"AccessSession::LOGIN_FAILURE" = "Tuntematon Skype-nimi ja salasana.";
"AccessSession::WISPR_LOGIN_REJECTED" = "Virheellinen käyttäjätunnus tai salasana.";

"SKYPEACCESS_NO_ACCOUNT" = "Kirjaudu sisään Skype-tilisi tiedoilla.";

"SKYPEACCESS_GENERIC_CONNECTION_ERROR" = "Yhteyttä ei voitu muodostaa. Tarkista WiFi-signaalin voimakkuus tai kokeile toista hotspottia.";
"SKYPEACCESS_GENERIC_FATAL_ERROR" = "Tämä hotspot ei vastaa oikein. Kokeile toista hotspottia.";

"SKYPEACCESS_SESSION_EXTEND_ERROR" = "Istuntoa ei voitu jatkaa. Yritä muodostaa yhteys uudelleen.";

"SKYPEACCESS_SESSION_LOSTWIFI_MESSAGE" = "WiFi-verkko %@ ei ole enää käytettävissä";
"SKYPEACCESS_SESSION_LOSTWIFI_EXPLANATION" = "Katkaise yhteys aina huolellisesti ennen kuin poistut hotspotin läheltä tai sammutat laitteesi. Näin vältyt odottamattomilta veloituksilta.";

"SKYPEACCESS_SESSION_LOSTWIFI_RECOVERABLE_MESSAGE" = "Muodosta uudelleen yhteys WiFi-verkkoon %@.";
"SKYPEACCESS_SESSION_LOSTWIFI_RECOVERABLE_EXPLANATION" = "Skype WiFi yrittää katkaista nettiyhteytesi. Katkaise yhteys aina huolellisesti ennen kuin poistut hotspotin läheltä tai sammutat laitteesi. Näin vältyt odottamattomilta veloituksilta.";

"SKYPEACCESS_SESSION_LOSTWIFI_AUTO_END_MESSAGE" = "Nettiyhteytesi on katkennut.";

"ACCESS_PRICE_PER_MINUTE_FORMAT" = "%@ minuutilta";
"ACCESS_PRICE_PER_MINUTE_FREE" = "Ilmainen";

/*
 * ===========
 * SkyLib localization (Skype Kit messages sent by SkyLib to other clients)
 * ===========
 */

/* Message sent in the P2P chat after it has been migrated to a server-based chat, and seen by legacy client users. */
"LOCALIZED_UPGRADE_MESSAGE_IN_P2P" = "käyttää uutta Skype-versiota, jossa on parempi keskustelukokemus.\nJos haluat osallistua ja jatkaa keskustelemista, lataa uusin versio.\nSiirry osoitteeseen <a href=\"http://www.skype.com/updateme\">Skype.com/updateme</a>.";
"LOCALIZED_UPGRADE_MESSAGE_IN_P2P_DOGFOOD" = "käyttää uutta Skype-versiota, jossa on parempi keskustelukokemus.\nJos haluat osallistua ja jatkaa keskustelemista, lataa uusin versio.\nSiirry osoitteeseen https://microsoft.sharepoint.com/teams/DogfoodSkype/.";

/* Message sent in the server-based chat as first message. Used to link the history of both conversations. The '%1' is replaced with the ID of the old chat. */
"LOCALIZED_UPGRADE_MESSAGE_IN_SERVER_BASED" = "Napsauta <a href=\"skype:?chat&amp;id=%1\">tätä</a> nähdäksesi aiemman historian.";
